app/views/orders/show.html.erb

               <td><%=item.updated_at.to_date.strftime("%d %B, %Y") %></td>
               <td> <% item.products.each do |products| %>
---
SELECT "products".* FROM "products" INNER JOIN "order_items" ON "products"."id" = "order_items"."product_id" WHERE "order_items"."order_id" = ?  [["order_id", 17]]