app/views/orders/show.html.erb

          <tr>
            <td><%=item.order_items %></td>
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 12]]