app/views/carts/show.html.erb


              <% cart.order_items.each do |ord_items|%>
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]