app/controllers/carts_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ? AND "orders"."status" = ? ORDER BY "orders"."created_at" DESC  [["user_id", 4], ["status", "In_cart"]]
---
  def show
    @cart = current_user.orders.where(status: 'In_cart')