app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."status" = ? ORDER BY "orders"."created_at" DESC  [["status", "In_order"]]
SELECT  "orders".* FROM "orders" LIMIT ?  [["LIMIT", 11]]
---
  def index
    @orderss= Order.where(status: 'In_order')
    @orders = @orderss.paginate(:page => params[:page])

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ? AND "orders"."status" = ? ORDER BY "orders"."created_at" DESC  [["user_id", 4], ["status", "In_order"]]
---
  def show
    @orders = current_user.orders.where(status: 'In_order').paginate(:page => params[:page])

UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", "Compleate"], ["updated_at", "2017-11-08 18:40:30.440649"], ["id", 15]]
DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 19]]
---
  def status
    @status=current_order.update_attributes(status: params[:status])
    redirect_to order_path(current_user)
    session.delete(:order_id)