app/controllers/order_items_controller.rb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ? AND "order_items"."product_id" = ? LIMIT ?  [["order_id", 8], ["product_id", 3], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "products".* FROM "products" INNER JOIN "order_items" ON "products"."id" = "order_items"."product_id" WHERE "order_items"."order_id" = ? AND "products"."category_id" = ? LIMIT ?  [["order_id", 8], ["category_id", 3], ["LIMIT", 1]]
DELETE FROM "order_items" WHERE "order_items"."id" = ?  [["id", 10]]
INSERT INTO "order_items" ("quantity", "product_id", "order_id", "created_at", "updated_at", "fixprice") VALUES (?, ?, ?, ?, ?, ?)  [["quantity", 1], ["product_id", 3], ["order_id", 23], ["created_at", "2017-11-17 19:38:12.894536"], ["updated_at", "2017-11-17 19:38:12.894536"], ["fixprice", 10.0]]
INSERT INTO "orders" ("user_id", "total_price", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?)  [["user_id", 4], ["total_price", 12.0], ["created_at", "2017-11-11 21:25:44.880134"], ["updated_at", "2017-11-11 21:25:44.880134"], ["status", "In_cart"]]
---
	def create
		@order = current_order
		@item = @order.order_items.new(item_params)
		category_id = Product.find(params[:order_item][:product_id]).category.id
		existing_product = current_order.products.find_by(category_id: category_id)
		current_order.order_items.find_by(product_id: existing_product.id).destroy if existing_product
		@order.save

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 9]]
---
	def show
		@cart = current_order.order_items