app/controllers/products_controller.rb

SELECT "products".* FROM "products"
SELECT "categories".* FROM "categories"
---
  def index
    @products = Product.all
    @categories = Category.all

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @product = Product.find(params[:id])

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @product = Product.find (params[:id])

INSERT INTO "products" ("title", "description", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "1 product"], ["description", "this's text"], ["price", 25.0], ["created_at", "2017-10-14 18:49:15.403602"], ["updated_at", "2017-10-14 18:49:15.403602"]]
---
  def create
    @product = Product.new(product_params)
    if @product.save

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "products" SET "image" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["image", "ice-cream-clipart-11.png"], ["updated_at", "2017-10-24 20:11:09.407296"], ["id", 2]]
---
  def update
    @product = Product.find(params[:id])
    if @product.update_attributes(product_params)