app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$kgx5z80EMXz36MABaUjVpuM.9o1.63ZAjXbWioTSmL5Ao6mrV1MrC"], ["updated_at", "2017-11-05 20:05:04.245273"], ["id", 3]]
---
  def update
    @user = User.find(params[:id])

    if @user.update_attributes(user_params)