app/views/products/_form.html.erb

SELECT "categories"."id", "categories"."name" FROM "categories"
---

        <%= f.select("category_id", Category.all.collect {|p| [ p.name, p.id ] }) %> </br><hr>