app/views/products/index.html.erb

    <div class="col-md-12">
    <%categories.products.each do |product|%>
---
SELECT "products".* FROM "products"